Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedWarning
"In order to find a matching part, the fitting has to be connected to a duct."

Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedError
"In order to find a matching part, the fitting has to be connected to a duct."

Autodesk.Revit.DB.BuiltInFailures.DuctFailures.NoDuctFittingsInProject
There are no duct fittings defined in project. The default duct type for fittings will be set to none.

Autodesk.Revit.DB.BuiltInFailures.DuctFailures.FlexDuctLengthOutOfLimits
The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value]

Autodesk.Revit.DB.BuiltInFailures.DuctFailures.CannotCreateGeometryForDuct
Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.

Autodesk.Revit.DB.BuiltInFailures.DuctFailures
Failures about Duct.